/*
	기본 자료형 : 숫자형, 문자열, 불
	
	변수/상수 : 데이터 1개 저장할 수 있는 공간
		1.변수 : 변하는 수[ let ] 												메모리(컴퓨터는 숫자를 좋아해) [단독주택]
							변수이름(문자) -----> 메모리주소(16진수)				식별 : 메모리 주소(번지)16진수
		2.상수 : 고정된 수[ const ]
	배열 : 데이터 여러개를 저장할 수 있는 공간 [아파트]
							배열이름(문자) -----> 메모리주소(16진수)

	연산자 : 1. 산술연산자 2. 비교연산자 3.논리연산자 4.대입연산자 5.증감연산자 6.삼황연산자
	제어 : if / switch
	반복 : for / while
	
	저장소 [= 메모리 = 주기억장치 = RAM]
	
		*명령어[1,0] -> 명령어 -> 프로세스 -> 프로그램
		
		
		
		키보드 / 마우스 -----입력----->				본체
										------------------
											1.CPU : 명령어 제어 / 연산 / 관리 등
												a >>> 100001 번역
												레지스터 : 명령어 임시 저장소
												
											2.주기억메모리 : "현재" 실행중인 프로그램[명령어]
															영구저장x	 , 변수
											3.보조기억장치 : SSD HDD USB C CD Datebase
															영구저장o
		모니터 <--------출력-------





 */